[
    {
        "id": 976,
        "title": "Java Developer",
        "similarity": 0.6251,
        "description": "Proficient in Java, J2EE and related technologies.\nExperienced in using spring, Spring Boot, Hibernate, messaging systems.\nGood understanding of relational database performance concepts and usage of ORM frameworks such as Hibernate\n• Expert understanding of the object-oriented design and programming concepts\n• Strong Knowledge on Data Structures, Algorithms and Collections.\nSolid experience building applications on top of RESTful APIs.\nKnowledge/experience with Spring MVC\nStroing knowledge in developing and executing automated unit, functional and integration tests\n• Good communication and analytical skills.\nStrong trouble shooting skills."
    },
    {
        "id": 624,
        "title": "Java Developer",
        "similarity": 0.5707,
        "description": "Java/MS developer with recent and strong hands-on experience in springboot for a high-visibility, aggressively planned, independent project where nobody will hand-hold and candidate should be capable of finishing off tasks on their own or if its new, learn and implement on their own.\n\n• Minimum 7+ years of experience in Javascript, Java 8 (Spring, Hibernate, Maven, REST API’s Microservices) JSON, XML\n• Good hands on experience in application server Tomcat\n• Good knowledge with DevOps tools like DevOps – BitBucket, Jira, Confluence, CI/CD pipelines (Jenkins), Nexus, Docker, Splunk\n• Exposure to Databases: MongoDB, PostgreSQL, Oracle\n• Microservices such as Spring Boot, API Gateway (Apigee), Scaling techniques\n• Working knowledge with Agile – TDD (Junit, Mockito, Jasmine, Karma), Scrum/Kanban,Cloud – AWS\n• Quick learner, eager to learn new technologies, tools and have to be a independent and flexible team player with excellent written and verbal communication skills.\nSTRONG HANDS-ON EXPERIENCE IN SPRINGBOOT AND MONGODB IS A MUST.*\nJob Type: Full-time\n\nBenefits:\nDental insurance\nHealth insurance\nLife insurance\nPaid time off\nParental leave\nReferral program\nRelocation assistance\nVision insurance\nSchedule:\nMonday to Friday\nWork Location:\nOne location\nVisa Sponsorship Potentially Available:\nNo: Not providing sponsorship for this job\nWork Remotely:\nTemporarily due to COVID-19"
    },
    {
        "id": 1314,
        "title": "Java Developer",
        "similarity": 0.5444,
        "description": "Strong experience of Core Java (8 and above is must), J2EE\nStrong experience in Spring3.0+(MVC, Rest, Security modules), Hibernate, JPA.\nSolid understanding of Object-Oriented Programming concepts, data structure, algorithms, and multi threaded programming.\nHands-on\nExpertise in developing RESTful Service APIs.\nShould have experience in HTML5, CSS, JQuery, JSTL, JSP\nStrong experience in complex hibernate/sql queries with MySql.\nShould have experience in integrating email, sms, payment gateway.\nShould have experience in debugging production environments using log and unix commands.\nShould have excellent aptitude in problem solving\nShould have experience in using Git, Maven, Eclipse\nShould have experience in accessing server via SSH and working on Ubuntu environment\nExcellent english written and spoken skills\nRegards,\nExpected Start Date: 1/1/2021\nJob Type: Full-time\nSalary: Up to ₹700,000.00 per year\nSchedule:\nDay shift\nExperience:\ntotal work: 2 years (Required)\njava: 2 years (Required)\nSping,Hibernate,Core Java: 2 years (Required)\nEducation:\nBachelor's (Required)\nWork Remotely:\nTemporarily due to COVID-19"
    },
    {
        "id": 972,
        "title": "Backend Developer",
        "similarity": 0.5407,
        "description": "We are looking software Engineer in Backend\nAt least 2 to 6 years of Core Java.\nStrong knowledge of OOAD.\nStrong knowledge of Spring framework spring boot.\nGood knowledge of data structures and algorithms.\nStrong knowledge of relational database.\nYou will be responsible for scaling the business processes to meet future business growth through automation and workflows.\nResearch and Details oriented mind-set.\nGood knowledge of any Application Server like Tomcat.\nAbility to work independently and within a team\nSkills required - Java, JPA Spring Boot (boot is must) Hibernate, MYSQL, Data Structures, Algorithms, mongoDB etc.\nNotice Period - immediate joiner/ 15days\nAbout Company\nCompany Name - PayMonk (Actas Technologies Pvt. Ltd).\nPaymonk is the leading FINTECH company and is funded by the Investor .\nwww.paymonk.com\nPayMonk is a FINTECH brand of ACTAS Technologies Private Limited. Headquartered in Noida, PayMonk is a rapidly growing full service FINTECH Solutions organization, providing cutting edge integrated Digital Financial Transaction Platform to its customers in India, North America, Europe & Africa. As a trusted partner to its customers, PayMonk provides its Digital Financial Transaction Platform to its customers by leveraging its strong technology expertise specific to the Financial domain.\nProducts-- Payment Gateway, Payment Wallet, AEPS, PoS, MPoS Money Transfer, Bill Payments, UPI ,MICRO ATM,PAN Card, IRCTC & many more services.\nJob Type: Full-time\nSalary: ₹300,000.00 - ₹800,000.00 per year\nExperience:\nspring boot: 1 year (Preferred)\ntotal work: 1 year (Preferred)\nJava: 1 year (Preferred)\ndata structures: 1 year (Preferred)\nEducation:\nBachelor's (Preferred)"
    },
    {
        "id": 698,
        "title": "JavaScript Developer",
        "similarity": 0.5159,
        "description": "We are looking for Java Full Stack Lead Developers with experience in building highperforming, scalable, enterprise-grade applications. Resource will be part of a talented software team that works on mission-critical treasury applications. Resource will be responsible for designing & development of the Treasury Applications while providing expertise in the full software development lifecycle, from concept and design to testing.\nRequirements\nJava 1.5 and above. [Good to have Java 1.8]\nSpringboot microservices, Spring (spring security, spring integration, spring batch, spring data, spring cloud, spring boot)\nJPA (Java Persistent API), Hibernate, MyBatis\nUnix/Linux-Any Unix flavor\nSQL/Database knowledge/Performance-Tuning\nAny messaging knowledge [JMS, KAFKA]\nHTML5, CSS, JavaScript [ES6] & Other Front-End Technologies\njQuery, Bootstrap, ReactJS, AngularJS, VueJS\nNode JS [Good to have]\nResponsive Design, Cross-Platform [Web & Mobile], Cross-Browser Environment compatibility, Object-Oriented Design, Web Services (REST/SOAP)\nWeb Services (Restful/Any web services)-Consumption experience is fine\nExperience With Git, Bitbucket\nKnowledgeable of REST-Based APIs\nKnowledgeable of Web Application Development Frameworks\nManage and Prioritize Project Work\nKnowledge in MariaDB, or at least should have knowledge in RMDB (e.g, MySQL, Oracle)\nPreferable to have knowledge in Private Cloud platform (Openshift, Kubernetes, Docker)\nAWS [Good to Have]\nHadoop: Hive/Impala/Spark [Good to Have]\nAny NoSQL Database [DynamoDB, MongoDB, CASSANDRA, HBase, etc…][Good to Have]\nFamiliar with Agile practice\nEstablish Continuous integration and Release automation\nGood Communication & Troubleshooting skills\nCandidate required to have below mentioned skills as well:\nExperience in FinTech with Global Markets experience\nStrong organizational skills to manage assignments effectively and working within tight deadlines\nStrong communications skills to collaborate with developers, QA, project managers and other stakeholders\nFamiliarity with the agile development process and experience in continuous integration such as Jenkins CI or its equivalent and experience in Java OOP, multi-threading is a plus\nPassion for learning and self-improvement is greatly preferred\nAt least 7 to 12 years of relevant working experience\nDegree in Computer Science/ IT or other related fields\nWork with various tech team for downstream reporting\nAble to manage the work in balance with the need to deliver in a disciplined manner within a minimal or no monitoring\nHas strong background in design and implementation of scalable architecture and a good understanding of Algorithms, Data structures and design patterns\nWe offer\nOpportunity to work on technical challenges that may impact across geographies\nVast opportunities for self-development: online university, knowledge sharing opportunities globally, learning opportunities through external certifications\nOpportunity to share your ideas on international platforms\nSponsored Tech Talks & Hackathons\nUnlimited access to LinkedIn learning solutions\nPossibility to relocate to any EPAM office for short and long-term projects\nFocused individual development\nBenefit package: Health benefits, Retirement benefits, Paid time off, Flexible benefits\nForums to explore beyond work passion (CSR, photography, painting, sports, etc.)\nLearn more about EPAM in India"
    }
]