[
  {
    "job_title": "Machine Learning",
    "job_description": "About Us:\nCareerNinja is building a personalised & experiential learning platform to make high-quality learning accessible at a mass global scale. It is revolutionising the way youth kickstart & upgrade their career. At the core of it is a unique adaptive learning product with an exclusive technology which enables course creation with 1/10th the effort & cost.\n*\nWhy Work With Us:\nBeing an education organisation, we take your growth seriously. Working with us could be your best decision if you're looking for learning, wide exposure & looking to be in the driving seat of what you do. You will be given real responsibilities, freedom to make decisions and come up with ideas and work closely with the founder and the core team, all in a flexible, casual and young (everyone under 28) work environment.\nWork from home(even without Covid), flexible work, free snacks, etc are just a regular part of our work life.\nMachine Learning Engineer\nWe are looking for an expert in Data Engineering, Machine Learning, Deep Learning and NLP. You will lead all the processes from R&D, data collection, cleaning, and preprocessing, to training models and deploying them to production. The ideal candidate will be passionate about artificial intelligence and stay up-to-date with the latest developments in the field. Most of our work revolves around text data so we need a candidate who has proven expertise in recent advancements in the field of NLP.\nResponsibilities:\nData Collection and Curation.\nSelect appropriate annotated datasets for Supervised Learning methods.\nUse effective text representations to transform natural language into useful features.\nFind and implement the right algorithms and tools for NLP tasks.\nDevelop ML/DL/NLP models according to requirements.\nTrain the developed model and run evaluation experiments.\nPerform statistical analysis of results and refine models.\nExtend ML libraries and frameworks to apply in NLP tasks.\nBuilding recommendation engines to increase the personalization of content for the user.\nTesting and deployment of models on cloud services i.e. AWS/GCP etc.\nAct as a bridge between product and engineering team to translate product requirements into the technical solutions.\nStay updated and use industry best practices and latest technology trends.\nPrototype ideas rapidly using cutting edge technologies, drive architecture discussions, and proposes solutions to system and product changes.\nRequirements:\nBachelors or higher degree in Computer Science or related technical field.\n2+ years of work experience in NLP, Machine Learning, Deep Learning and Data Science.\nStrong experience in developing, deploying and monitoring large scale models in production environments from scratch.\nDeep understanding and working knowledge of frameworks like PyTorch/TensorFlow/Keras.\nStrong Exposure to at least 1-2 state of the art NLP algorithms e.g GPT, BERT, T5, RoBERTa, Hugging Faces etc.\nDeep understanding of NLP techniques for text representation, semantic extraction techniques, data structures and language modelling.\nExperience with NLP libraries and technologies including Spacy, NLTK, Gensim, Stanford NLP etc.\nProficiency with Python and basic libraries for machine learning such as Numpy, Scikit-learn and pandas.\nExposure to DL Model optimisation and transfer learning technique.\nExperience of cloud environment AWS/GCP, Hadoop/Spark, SQL is a plus.\nExperience with technologies like Docker, Kubernetes, CI/CD, Git is a plus.\nExperience with ML Ops is a plus.\nA team player who can work independently too.\nExcellent written and verbal communication skills.\nMulti-tasking and time-management skills, with the ability to prioritize tasks.\n*\nJob Type: Full-time\nSalary: ₹800,000.00 - ₹1,500,000.00 per year\nExperience:\nMachine Learning: 2 years (Required)\nwork: 3 years (Preferred)\ntotal work: 2 years (Preferred)\nEducation:\nBachelor's (Required)\nWork Remotely:\nTemporarily due to COVID-19",
    "similarity_score": 0.013701035641133785
  },
  {
    "job_title": "Machine Learning",
    "job_description": "We are looking for an outstanding *Machine Learning Engineer* with an adaptable and productive working style which fits in a fast-moving startup. This role will start off with a 3-month contract leading to a full-time position in our company. The role requires an independent thinker with ML knowledge, able to use sophisticated and state of the art techniques to contribute to tasks like building an extraction algorithm which can read and evaluate information from resumes effectively. You must be able to translate technical concepts into implementable solutions, whilst communicating results and benefits clearly to your colleagues.\nWhat we are working on: *\nWe are currently working on a product which is an applicant tracking system. As a product with a huge scope for being an intelligent system to automatically complete mundane tasks, we would like to leverage the ample amount of research available out there in the machine learning space.\n\nMany Human Resource personnel struggle with the repetitive task of going through every resume to decide whether the candidate fits the profile. Our machine learning algorithms are trained on tons of resumes to decide whether a candidate makes the cut or not.\nResponsibilities: *\nImplement, evaluate and optimize algorithms and models for our information extraction and candidate scoring algorithms.\nUse NLP/Machine Learning techniques including linear/logistic regression, decision trees, classification, entity recognition, ensembles, text mining to build models.\nSelecting and transforming features, building and optimizing classifiers using machine learning techniques.\nProvide software design and programming support to research projects.\nRequired Skills: *\nAt least 2 years hands on experience in the development of machine learning based systems.\nExperience working with NLP techniques, entity recognition, predictive modeling, and other analytical techniques over structured as well as unstructured datasets.\nAbility to read, understand and implement the latest research papers from top conferences like NIPS, CVPR, and ICML.\nStrong Python programming skills and working experience in libraries like Pandas and Numpy.\nAbility to quickly prototype solutions and perform critical analysis.\nAbout Us: *\nFullThrottle Labs has a wide and diverse portfolio of B2B SAAS business productivity applications which include marketing automation software primarily targeted towards Y Combinator startups, team management software 'DixiApp' which has over 1500 companies using it globally, an identity resolution platform 'Truemailer', and finally a hiring automation platform 'PyjamaHR' that we've just launched in Q1 2020. Besides the above, we work with select Y Combinator startups and provide niche consulting in Automation & Machine Learning using our expertise in these areas. Having seen traction and growing revenue with incredible potential in the market, FullThrottle Labs is eager to scale rapidly. Join us to be a part of the journey!\nBenefits/Perks: *\nFullThrottle Labs offers an array of benefits including competitive salaries, equity options, free food and beverages and weekly team outings!\nLocation: * Bangalore (Koramangala - 8th Block)\nJob Type: Full-time\n\nSalary: ₹800,000.00 - ₹1,400,000.00 per year\n\nSchedule:\nMonday to Friday\nSupplemental Pay:\nOvertime pay\nYearly bonus\nExperience:\nMachine Learning: 2 years (Required)\nEducation:\nBachelor's (Preferred)\nWork Remotely:\nTemporarily due to COVID-19",
    "similarity_score": 0.012839348055422306
  },
  {
    "job_title": "Machine Learning",
    "job_description": "Innovate to solve the world's most important challenges\nKey responsibilities -\nImplementation of end-to-end statistical/ML/analytics solutions as per the industry standard process, CRISP-DM\nUnderstand business requirements and propose suitable solutions\nExplore, devise and implement ML algorithm stack\nExperiment, prototype and finalize specific solution with the best business metrics\nDesign and implement architecture/tech stack for data integration, data flow and data storage for ML solutions\nCollaborate with product teams across the organization for deployment and integration of AI solutions in existing products\nDeliver production quality, modular, reproducible code in Python\nCreate data visualizations to visualize raw data and analytics insights to demonstrate efficacy of the solution\n\nRequirements\nSolid understanding of statistics, probability, ML and DL\nA minimum of 2 years of experience in developing and deploying end-to-end AI/ML solutions in production environment\nExposure to reinforcement learning, supervised and unsupervised algorithms, various architectures of neural networks, time series forecasting, deep learning networks\nDeep expertise in any specific application of ML and DL\nPrior experience in building and deploying ML pipelines from data ingestion, preparation to deploying models in production\nAn understanding of various databases relational, NoSQL with prior experience in any DB\nExposure to ML and DL frameworks like TensorFlow, PyTorch, Caffe, etc\nFamiliarity with ML testing and data validation frameworks\nGood to have\nFamiliarity with IoT communication protocols like MQTT\nEdge AI deployment experience\nHTSIND2020\nAdditional Information\nJOB ID: HRD104227\nCategory: Engineering\nLocation: Devarabisanahalli Village, KR Varturhobli,,East Taluk - Phase I,Bangalore,KARNATAKA,560103,India\nExempt\nBusiness Services",
    "similarity_score": 0.012493439018726349
  },
  {
    "job_title": "Java Developer",
    "job_description": "Senior QA Engineer (Selenium, Java) - Bangalore\nCompensation: Best in the industry - Fixed + Bonus + Stock options (10x expected in 3 years)\nCompany: Eltropy is one of the fastest growing boot strapped Silicon Valley SaaS startups. We have financial institution customers in the US and Japan. We added 100+ customers in the last 12 months and are on to reach 1,000 customers in 3 years and IPO soon after. Do you want to ride this rocket ship?\nProduct: Eltropy is an intelligent enterprise-class messaging-based platform fueled by artificial intelligence. As a global software-as-a-service (SaaS) provider, Eltropy empowers businesses to connect with their customers on SMS and text messaging apps, such as WhatsApp, iMessage, WeChat, Line, Facebook Messenger, KakaoTalk, Telegram, and Viber.\nResponsibilities\n- Selection or identification of test cases for automation from existing test case documentation.\n- Automate the regression suites to ensure stability in the product\n- Automation of functional testing, integration testing, Mobile application testing, Core banking integration testing\n- Automation of APIs testing. Adhere to release timelines with no compromise to quality\n- Estimate QA effort for any feature and communicate the same for the release planning\n- High standard expectation of code from developers and documentation from the product team\nCommunication\n- Effective, timely communication about the project status. Highlighting the risks upfront if there are any which could result in delivery delay\nWork experience\n5 to 10 years of relevant experience in QA and QA Automation\nAcademic qualifications\nBachelor's degree in Computer Science or equivalent\nJob Type: Full-time\nPay: ₹2,500,000.00 - ₹5,000,000.00 per year\nBenefits:\nFlexible schedule\nHealth insurance\nInternet reimbursement\nPaid sick time\nPaid time off\nWork from home\nSchedule:\nMonday to Friday\nSupplemental Pay:\nYearly bonus\nCOVID-19 considerations:\nWorking from remote/home until it's fully safe to open offices\nExperience:\nSelenium: 3 years (Required)\nJava: 4 years (Preferred)\nIndustry:\nSoftware Development\nWork Remotely:\nYes, temporarily due to COVID-19\nCOVID-19 Precaution(s):\nRemote interview process",
    "similarity_score": 0.012488079257309437
  }
]